"""
Дан список чисел. Определите, сколько в нем втречаеться различных чисел
Input:[1, 1, 2, 0, -1, 3, 4, 4]
Output: 6
"""

list1 = [1, 1, 2, 0, -1, 3, 4, 4]
print(len(set(list1)))
